package ru.job4j.classandobject;

/**
 * Local Variables
 * Локальные переменные и поля. [#180148] 09.2019
 * В самых первых уроках мы познакомились с понятием переменной.
 * Переменная - это контейнер для нашей информации.
 * Когда мы коснулись темы объектов, то появилось новое понятие -
 * поле объекта. В чем отличие?
 * Поле объекта - это тоже переменная, которая связана с этим объектом. Пока мы работаем с объектом,
 * мы можем работать и с этим полем.
 * Локальная переменная принадлежит методу.
 * Работать с этой переменной мы можем только внутри этого метода.
 * Как отличить локальную переменную от поля объекта?
 * Локальная переменная объявляется внутри метода.
 * Поле объекта объявляется в области класса,
 * она не может объявляться в методе.
 */
