package ru.job4j.streamphonebook;

/**
 * Job a telephone directory do using the Stream API
 * Задание Телефонный справочник сделать с использованием Stream API
 *
 * Задача:
 * Все задачи из 3 части переделать на Stream API.[#99022]
 *
 * Переделка:
 * 1. Телефонный справочник на базе ArrayList[#99114][#41598]
 *
 * Частой задачей программиста является поиск данных в списках.
 * Давайте с Вами напишем программу поиска в списке.
 * У нас есть пользователь с полями: name, surname, phone, address.
 *
 *
 */