package ru.job4j.encapsulation;

/**
 * Encapsulation Description
 * 0. Что такое инкапсуляция (или закрытие). [#3818] 01.2020
 * Этот механизм позволяет скрыть реализацию кода
 * класса от пользователя этого класса.
 * Пользователь класса может записать данные
 * или вызвать методы, которые повлекут ошибку
 * в работе этого класса. Механизм инкапсуляции
 * позволяет запретить обращаться к методам или полям.
 *
 * В Java используется модификаторы доступа.
 *
 * Модификаторов всего 4: public, protected, default и private.
 * Модификатор доступа располагается вначале элемента:
 * класса, конструктора, метода, поля класса.
 * К локальным переменным модификаторы не применяются.
 *
 * public - элемент обозначенный этим модификатором
 * доступа доступен везде в программе.
 *
 * protected - элемент обозначенный этим модификатором
 * доступа доступен внутри пакета и в наследниках.
 *
 * default - элемент обозначенный этим модификатором
 * доступа доступен внутри пакета.
 *
 * private - элемент обозначенный этим модификатором
 * доступа доступен внутри класса.
 */
